{"inputs": "[0] ''The Lone Rider in Frontier Fury'' is a 1941 American film directed by Sam Newfield. [1] The film is also known as ''Frontier Fury'' in the United Kingdom and ''Rangeland Racket'' (American reissue title). [CONTEXT] (0) List_of_American_films_of_1941 I–N - Table-0-45 [HEADER] [COL] Title [COL] Director [COL] Cast [COL] Genre [COL] Notes [ROW] [COL] ''The Lone Rider in Frontier Fury'' [COL] Sam Newfield [COL] George Houston, Al St. John, Hillary Brooke [COL] Western [COL] PRC (1) Karl_Hackett Selected filmography - Table-0-25 [CAPTION] List of acting performances in film [HEADER] [COL] Year [COL] Title [COL] Role [ROW] [COL] ''The Lone Rider in Frontier Fury'' [COL] Matt Malone (2) Al_St._John_filmography Fuzzy Q. Jones appearances - Table-0-19 [HEADER] [COL] Title [COL] Release Date [COL] Director [COL] Star [COL] Studio [COL] Distributor [COL] Home Video [ROW] [COL] ''The Lone Rider in Frontier Fury/Rangeland Racket'' [COL] 1941-8-8 [COL] Sam Newfield [COL] George Houston [COL] PRC [COL] PRC [COL]", "targets": "[0] (0) (1) The film stars George Houston as the \"Lone Rider\" and Al St. John as his sidekick \"Fuzzy\" Jones, with Hillary Brooke, Karl Hackett, Ted Adams and Arch Hall Sr. (0) The film was released on August 8, 1941, by Producers Releasing Corporation. [1] This is the fourth movie in the \"Lone Rider\" series, which spans seventeen films -- eleven starring George Houston, and a further six starring Robert Livingston. Houston, once an opera singer, sang three songs in this film: \"Down by the Old Alamo\", \"A Love That Faded Too Soon\" and \"Ride 'Em Cowboy\". The songs were written by Johnny Lange and Lew Porter.", "normalized_inputs": "''The Lone Rider in Frontier Fury'' is a 1941 American film directed by Sam Newfield. The film is also known as ''Frontier Fury'' in the United Kingdom and ''Rangeland Racket'' (American reissue title).", "normalized_targets": "''The Lone Rider in Frontier Fury'' is a 1941 American film directed by Sam Newfield. The film stars George Houston as the \"Lone Rider\" and Al St. John as his sidekick \"Fuzzy\" Jones, with Hillary Brooke, Karl Hackett, Ted Adams and Arch Hall Sr. The film was released on August 8, 1941, by Producers Releasing Corporation. The film is also known as ''Frontier Fury'' in the United Kingdom and ''Rangeland Racket'' (American reissue title). This is the fourth movie in the \"Lone Rider\" series, which spans seventeen films -- eleven starring George Houston, and a further six starring Robert Livingston. Houston, once an opera singer, sang three songs in this film: \"Down by the Old Alamo\", \"A Love That Faded Too Soon\" and \"Ride 'Em Cowboy\". The songs were written by Johnny Lange and Lew Porter."}
{"inputs": "[0] William Emmanuel Bevan, known by his recording alias Burial, is a British electronic musician from South London. [1] Initially remaining anonymous, Burial became the first artist signed to Kode9's electronic label Hyperdub in 2005. [2] He released his self-titled debut album, which drew inspiration from UK rave music and pirate radio culture, to acclaim in 2006; it was named the album of the year by ''The Wire''. [3] Burial's second album, ''Untrue'', was released to further critical acclaim in 2007. [4] In 2008, Bevan's identity was revealed by ''The Independent'' and confirmed by Hyperdub. [5] He has gone on to collaborate with Four Tet, Massive Attack, Thom Yorke and Zomby in addition to releasing a series of acclaimed long-form EPs, including the critically acclaimed ''Kindred'' (2012), as well as ''Rival Dealer'' (2013). [6] He has remained reclusive, giving few interviews and avoiding public appearances. [7] AllMusic described him as \"one of the most acclaimed, influential, and enigmatic electronic musicians of the early 21st century.\" [CONTEXT] (0) List_of_2019_albums Fourth quarter - December - Table-0-2 [HEADER] [COL] Release date [COL] Artist [COL] Album [COL] Genre [COL] Label [COL] Ref [ROW] [COL] December6 [COL] Burial [COL] ''Tunes 2011–2019'' [COL] [COL] Hyperdub [COL] (1) List_of_2012_albums First quarter - February - Table-0-20 [HEADER] [COL] Release date [COL] Artist [COL] Album [COL] Genre [COL] Label [COL] Producer [COL] Ref. [ROW] [COL] February 13 [COL] Burial [COL] ''Kindred'' [COL] Dubstep, 2-step garage [COL] Hyperdub [COL] Burial [COL] (2) Tunes_2011–2019 INTRODUCTION ''Tunes 2011–2019'' is the second compilation album by British electronic musician Burial. (3) Rewind_(The_Wire) Critics' polls - Table-0-23 [HEADER] [COL] Year [COL] Artist [COL] Album [COL] Musical genre [COL] Nation [COL] Poll name [COL] [ROW] style=\"height:3.5em;\" [COL] 2006 [COL] Burial [COL] ''Burial'' [COL] Dubstep [COL] UK [COL] (4) Ninja_Tune History - 2000–2010 Recorded over three years with its maker living in his studio, without a kitchen or shower, the album included collaborations with Warrior Queen, Tippa Irie, Burial, Kode9 collaborator Spaceape, and even singer-toaster Ricky Ranking showing up on three tracks. (5) Vivid_Live Artist lineups by year - 2018 * Iron & Wine * Neil Finn * Total Control & Friends * Middle Kids * No Mono * Joep Beving * Fugazi's ''Instrument'' * Xylouris White * HTRK * An Evening with Repressed Records * ''Ambient 1: Music for Airports'' performed by Alaska Orchestra * Club Kooky * Kuren + Electric Fields * Burial 12\"s all night long * Astral People * Mad Racket * Lighting of the Sails (6) Konsolation INTRODUCTION The album includes previously unreleased music from artists such as Burial, Scratcha DVA, and Ikonika, and was released as a video game cartridge bundled with a limited edition of Analogue's Mega Sg, a remake of the Sega Genesis. (7) Hauntology_(music) Etymology and history In 2019, ''The Guardian'' associated \"Boards of Canada’s TV-sampling electronica, Burial’s dubstep, and the Ghost Box label’s folk horror soundworlds\" with hauntology. (10) Hauntology_(music) INTRODUCTION Hauntology is associated with the UK record label Ghost Box, in addition to artists such as the Caretaker, Burial, and Philip Jeck", "targets": "[0] [1] (1) He won acclaim the following year for his self-titled debut album, which showcased a dark, emotive take on UK rave music styles such as 2-step garage and jungle; it was named the album of the year by ''The Wire''. [3] [4] (0) (2) In the following years, he went on to collaborate with Four Tet, Massive Attack, Thom Yorke and Zomby in addition to releasing a series of long-form EPs such as ''Kindred'' (2012), ''Truant / Rough Sleeper'' (2012), and ''Rival Dealer'' (2013); most of these releases were later compiled on the 2019 compilation ''Tunes 2011–2019''. [6] [7]", "normalized_inputs": "William Emmanuel Bevan, known by his recording alias Burial, is a British electronic musician from South London. Initially remaining anonymous, Burial became the first artist signed to Kode9's electronic label Hyperdub in 2005. He released his self-titled debut album, which drew inspiration from UK rave music and pirate radio culture, to acclaim in 2006; it was named the album of the year by ''The Wire''. Burial's second album, ''Untrue'', was released to further critical acclaim in 2007. In 2008, Bevan's identity was revealed by ''The Independent'' and confirmed by Hyperdub. He has gone on to collaborate with Four Tet, Massive Attack, Thom Yorke and Zomby in addition to releasing a series of acclaimed long-form EPs, including the critically acclaimed ''Kindred'' (2012), as well as ''Rival Dealer'' (2013). He has remained reclusive, giving few interviews and avoiding public appearances. AllMusic described him as \"one of the most acclaimed, influential, and enigmatic electronic musicians of the early 21st century.\"", "normalized_targets": "William Emmanuel Bevan, known by his recording alias Burial, is a British electronic musician from South London. Initially remaining anonymous, Burial became the first artist signed to Kode9's electronic label Hyperdub in 2005. He won acclaim the following year for his self-titled debut album, which showcased a dark, emotive take on UK rave music styles such as 2-step garage and jungle; it was named the album of the year by ''The Wire''. Burial's second album, ''Untrue'', was released to further critical acclaim in 2007. In 2008, Bevan's identity was revealed by ''The Independent'' and confirmed by Hyperdub. In the following years, he went on to collaborate with Four Tet, Massive Attack, Thom Yorke and Zomby in addition to releasing a series of long-form EPs such as ''Kindred'' , ''Truant / Rough Sleeper'' , and ''Rival Dealer'' ; most of these releases were later compiled on the 2019 compilation ''Tunes 2011–2019''. He has remained reclusive, giving few interviews and avoiding public appearances. AllMusic described him as \"one of the most acclaimed, influential, and enigmatic electronic musicians of the early 21st century.\""}
{"inputs": "[0] Primearth EV Energy (PEVE) is the supplier of the nickel–metal hydride battery (NiMH) packs for Toyota’s hybrids, as well as for Honda (Civic hybrid and first generation Insight) hybrids. [1] The company also provides the NiMH prismatic battery modules for the General Motors 2-mode hybrids. [2] The company currently offers only NiMH products. [3] The company was known as Panasonic EV Energy Co until 2 June 2010. [4] The company was formed in 1996 as a joint venture between Toyota and Panasonic, with Panasonic holding 60% of the capital. [5] Panasonic sold 40.5% of the company to Toyota as a condition of purchasing Sanyo. [6] Panasonic decided to reduce its stake in Panasonic EV Energy Co to speed up approval from antitrust authorities in China and the U.S. [7] The planned purchase of Sanyo would give Panasonic a market share of around 80% in nickel hydride batteries. [8] In early 2011, it is reported that Prime Earth EV Energy will start mass-producing lithium batteries for plug-in hybrids of Toyota at a factory in Shizuoka Prefecture, south of Tokyo, Japan. [CONTEXT] (0) List_of_electric-vehicle-battery_manufacturers INTRODUCTION - Table-0-20 [CAPTION] List of largest EV battery manufacturers [HEADER] [COL] Battery manufacturer [COL] Notes [COL] Year founded [COL] Production capacity (GWh) [COL] Used in production vehicle [COL] Type of battery [COL] Still in operation [ROW] [COL] Primearth EV Energy Co, a joint venture between Toyota and Matsushita Electric Industrial Co [COL] Future Toyota products [COL] [COL] [COL] [COL] NiMH, lithium-ion [COL] (1) Panasonic Current operations - Automotive - Prime Planet Energy & Solutions It was the second time the two companies joined hands in the realm of battery technology after Primearth EV Energy (PEVE) kicked off in 1996 to produce batteries for hybrid electric cars.", "targets": "(0) (1) Primearth EV Energy Co., Ltd. (abbreviated as PEVE) is a Japanese manufacturer of prismatic nickel–metal hydride (NiMH) and lithium-ion battery packs for hybrid electric vehicles, located in Shizuoka Prefecture, Japan. PEVE's products had been soley based on NiMH until early 2011 when the company has started mass production of Li-ion battery. The company, originally called Panasonic EV Energy Co. until 2 June 2010, was founded in 1996 as a joint venture between Toyota and Panasonic, with Panasonic holding 60% of the capital. [5] Panasonic decided to reduce its stake in PEVE to speed up the process of getting approvals from antitrust authorities in China and the U.S. The planned purchase of Sanyo would hand Panasonic a market share of around 80% in nickel hydride batteries. PEVE has supplied battery packs for HEVs and PHEVs mainly of Toyota, including the Toyota Prius, but also of Honda and General Motors. In 2020, Panasonic and Toyota have formed the second EV battery joint venture named Prime Planet Energy & Solutions (PPES) that would focus on the development and manufacturing of Li-ion battery and a solid-state battery.", "normalized_inputs": "Primearth EV Energy (PEVE) is the supplier of the nickel–metal hydride battery (NiMH) packs for Toyota’s hybrids, as well as for Honda (Civic hybrid and first generation Insight) hybrids. The company also provides the NiMH prismatic battery modules for the General Motors 2-mode hybrids. The company currently offers only NiMH products. The company was known as Panasonic EV Energy Co until 2 June 2010. The company was formed in 1996 as a joint venture between Toyota and Panasonic, with Panasonic holding 60% of the capital. Panasonic sold 40.5% of the company to Toyota as a condition of purchasing Sanyo. Panasonic decided to reduce its stake in Panasonic EV Energy Co to speed up approval from antitrust authorities in China and the U.S. The planned purchase of Sanyo would give Panasonic a market share of around 80% in nickel hydride batteries. In early 2011, it is reported that Prime Earth EV Energy will start mass-producing lithium batteries for plug-in hybrids of Toyota at a factory in Shizuoka Prefecture, south of Tokyo, Japan.", "normalized_targets": "Primearth EV Energy Co., Ltd. (abbreviated as PEVE) is a Japanese manufacturer of prismatic nickel–metal hydride (NiMH) and lithium-ion battery packs for hybrid electric vehicles, located in Shizuoka Prefecture, Japan. PEVE's products had been soley based on NiMH until early 2011 when the company has started mass production of Li-ion battery. The company, originally called Panasonic EV Energy Co. until 2 June 2010, was founded in 1996 as a joint venture between Toyota and Panasonic, with Panasonic holding 60% of the capital. Panasonic sold 40.5% of the company to Toyota as a condition of purchasing Sanyo. Panasonic decided to reduce its stake in PEVE to speed up the process of getting approvals from antitrust authorities in China and the U.S. The planned purchase of Sanyo would hand Panasonic a market share of around 80% in nickel hydride batteries. PEVE has supplied battery packs for HEVs and PHEVs mainly of Toyota, including the Toyota Prius, but also of Honda and General Motors. In 2020, Panasonic and Toyota have formed the second EV battery joint venture named Prime Planet Energy & Solutions (PPES) that would focus on the development and manufacturing of Li-ion battery and a solid-state battery."}
